m/crystal/articles/discord.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-03-01 Fri 15:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>**Discord** : an internet cancer</title>
<meta name="author" content="Crystal" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../src/css/colors.css"/>
<link rel="stylesheet" type="text/css" href="../src/css/style.css"/>
<link rel="icon" type="image/x-icon" href="../../favicon.png">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://crystal.tilde.institute/"> UP </a>
 |
 <a accesskey="H" href="https://crystal.tilde.institute/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title"><b><b>Discord</b></b> : an internet cancer</h1>
<div id="outline-container-org553a52a" class="outline-2">
<h2 id="org553a52a">Preamble</h2>
<div class="outline-text-2" id="text-org553a52a">
<p>
Before I start writing this article, I just want to clarify that I will NOT go over the technical aspect of <b><b>Discord</b></b> (such as the spyware and all) as it has been covered many times by other websites like <a href="https://spyware.neocities.org/articles/discord">This one !!!</a>, but basically, it&rsquo;s exactly how you expect it to be, spying, selling data, monitoring open processes, terrible electron based app&#x2026;.etc
</p>

<p>
I also wanted to make it clear that this is PURELY from my personal experience with <b><b>Discord</b></b> and the <b><b>Internet</b></b> as a whole, this isn&rsquo;t an exact science and everybody can have an - although similar - different experience with the platform. Peace and love &lt;3
</p>
</div>
</div>
<div id="outline-container-org564e0f1" class="outline-2">
<h2 id="org564e0f1">Chapter one : Curiosity</h2>
<div class="outline-text-2" id="text-org564e0f1">
<p>
Picture yourself, it&rsquo;s 2018/2019 and you are playing your favorite game, be it <b><b>Minecraft</b></b>, <b><b>League of Legends</b></b>, <b><b>CS:GO</b></b>, doesn&rsquo;t matter. You start to play nicely, you make some friends, some enemies, typical gameplay. And then, one of them decides to take a step closer into your life, so they invite you to this cool new platform you have never heard about, <b><b>Discord</b></b>. Upon checking, you notice it&rsquo;s a modern chat application for gamers&#x2026;. &ldquo;huh, must be nice&rdquo; you might say. And then you are faced with a choice, you either create an account, or you don&rsquo;t.
</p>

<p>
If you decide to NOT make an account, you would be made fun of by that friend, or even get blamed for loses because &ldquo;you weren&rsquo;t in the voice chat&rdquo;, you will be called a &ldquo;Skype user&rdquo;, probably miss out on events, giveaways, exclusive prizes and sometimes even get banned from that game server (Yeah, it happened on <b><b>Minecraft</b></b> before, failure to join the discord server actually rejects you from the Minecraft server). And even if we take a more&#x2026;casual example, you found a cool piece of software online, but their guides and download links are all on <b><b>Discord</b></b>, or Discord exclusive, maybe you want to work with a team that solely use Discord. Basically you are missing out on a LOT.
</p>

<p>
However, if you take the path of least resistance and decide to sign up, entering your e-mail address, password, birth date, and in the unfortunate case where you use a <b><b>VPN</b></b> or <b><b>TOR</b></b>, your phone number, pick a username and a profile picture. Congratulations, you now cursed yourself for the rest of your life. Remember that friend we imagined ? You play a few games together in VC, you crack jokes, you get to know each other&#x2026; it&rsquo;s all fun and games, but then, they send you a link you never saw before. Apparently it&rsquo;s how you add people to groups in discord, they are called &ldquo;Servers&rdquo;
</p>

<p>
&gt; emkey.jpeg
</p>

<p>
So you join that group they invited you to, it could be anything from a small friend group, to a large server with giveaways and events. But they all share one aspect, a hierarchy.
</p>
</div>
</div>
