m/crystal/articles/discord.html
<div id="outline-container-org8d01749" class="outline-2">
<h2 id="org8d01749">Chapter two : The hierarchy</h2>
<div class="outline-text-2" id="text-org8d01749">
<p>
Now this hierarchy is not inherently bad, but this is how <b><b>Discord</b></b> (and even the communities on Discord) keep you addicted to them. When you join, you start as a peasant, a pleb, a noobie even. You have an ugly color for your username, and no access to &ldquo;channels&rdquo;, only few ones with cooldowns so you don&rsquo;t talk much. And then you look at the members list, and you see a beautiful rainbow, people divided into categories, or roles as they like to call them!!
</p>

<p>
At the top you will most likely find the Owner(s) or their loved ones, with colors that inspire majesty and fear, like a dark purple, these are the masters of the server, they shape it the way they want and in the rare occasion where they join the plebs in their discussions, they are met with rounds of applause.
</p>

<p>
Then just below them you have the Right hand(s) of the owners, generally veterans and original members, they have a bright, warm yet still majestic color to their role. These have the same power as the Owners, but are more active in the server and are actually hated by a lot of users, who unfairly got banned or kicked.
</p>

<p>
Then just below them you have the Bots, non-human, non-sentient beings, most of the time with a silvery metallic color as their username which are there to execute the Owners commands, or just to annoy the plebs, like a tax collector after a long day of work <b>&ldquo;Congratulations you just advanced to level 5&rdquo;</b>
</p>

<p>
Now, you have the Moderators, these have some power, have an aggressive color as their role and are generally the ones who try to control the Chaos in the server, although most of the time they fail due to a lack of permissions, or threats from the Owners themselves. Regardless, these are the ones with the biggest ego, and most importantly they are the ones causing server splits.
</p>

<p>
If the aforementioned roles are considered black, and normal users are white, then Helpers are definitely the gray line separating them. They are peasants who strive to go a rank higher, to be a majesty, and have some power. But most of the time, they are there for an eternity, or they just go from there all the way up to a Right hand using some witchcraft&#x2026;.Oh and their color is almost always Green :D
</p>

<p>
After that we have the Plebeians which are also separated in an attempt to control them easily. But I&rsquo;m going to go through the list quickly otherwise this article will take ages : you have the supporters - people who helped the server financially or in other ways -, partners which are just owners of other servers who decided to become living billboards, you have event winners to remind the others of what they can achieve if they wait long enough, then we have the activity roles, the more you are active, the more you have rights over casual users, this is definitely not a way to keep you addicted to the group discussion ;3
</p>

<p>
And finally, you have the outcasts, warned or muted people are all the way down the list, and they have little to no rights or uses in the server, quite frankly if they left they would have a better time !!!!
</p>


<p>
Okay so, in all seriousness. This at first glance doesn&rsquo;t seem like a bad idea, after all you need order and laws in an easily accessible group. But this is not the way it&rsquo;s used, this hierarchy is constantly there to remind you of what you can be if you are liked enough by the owners, what you can achieve. And in most cases, you get access to exclusive channels, a secret club, creating a sense of scarcity and power. This is bad because it keeps people invested in discussions they honestly don&rsquo;t want nor need to have, but they are obliged, otherwise they are just a &ldquo;powerless normie&rdquo;.
</p>

<p>
Now what happens if a Mod or an Owner decides to abuse their power ? Well in this case, here are the different outcomes :
</p>

<ul class="org-ul">
<li>Either people get angry and start spamming and protesting (usually ends with a purge or a mass ban)</li>
<li>People just blame the victim because it&rsquo;s more profitable</li>
<li>An other rogue mod decides to take control and destroy the server</li>
<li>Or if it&rsquo;s a disagreement between Owners, the server undergoes a split</li>
</ul>


<p>
If you are paying attention, you would know that all of these will always end with the same ending : &ldquo;Another server gets created&rdquo;, and so this is how&#x2026;
</p>
</div>
</div>
<div id="outline-container-org4849802" class="outline-2">
<h2 id="org4849802">Chapter three : <b><b>Discord</b></b> takes a once thriving community and splits it</h2>
<div class="outline-text-2" id="text-org4849802">
<p>
Yes, there are always splits, and communities divide into multiple tiny sub-communities with their own opinions about useless matters. That is how you are kept invested. People love Drama, they love wars and they love picking sides.
</p>

<p>
Let&rsquo;s imagine together a simulation for what i mean, since i can&rsquo;t draw or animate, use your imagination:
</p>
<ul class="org-ul">
<li>You have a big red circle, its <b>Group A</b>, a pretty large tech community, with tiny dots inside with different colors, these are members and the colors represent their roles.</li>
<li>Once in a while, a fight happens in this group. Let&rsquo;s say there is a fight between two normal users, a mod steps in and bans the user who is in the wrong. Not a big deal so far !</li>
<li>Now let&rsquo;s imagine this scenario again, but with a different person, <b>Kevin</b>, a normal user in the group, but with a consistent presence, he is loved by a handful of people. Sadly he gets wrongly banned&#x2026; wrong move for the mod, because now <b>Kevin</b> takes his supporters and make their own group, a blue one called <b>Group B</b></li>
<li><b>Group A</b>&rsquo;s growth is starting to diminish because there is nothing to do there, and people are slowly moving to group <b>Group B</b> because of the overall aesthetic, in an attempt to win back their following, <b>Group A</b> decide to make events and reward their loyal followers. It kinda works but <b>Group B</b> is in a study growth</li>
<li>Oopsie, there is a minor disagreement between <b>Group A</b> owners, and it turns into a big war between them. which ends up with members taking sides and dividing the server in half, creating two new communities <b>Group C</b> and <b>Group D</b></li>
<li>And now, you know what is interesting ? is that all these 4 groups are not only semi-dead, but have the same users in them. AND SHARE THE SAME TOPIC</li>
</ul>

<p>
So you basically killed a community, in 6 easy steps !!! And of course this will end up either by a mass deletion of these groups by a rogue Moderator, or a ban, or a screw up. So if the server contained important non-archived data. They are looong gone!!!
</p>
</div>
</div>
