m/crystal/articles/discord.html
<div id="outline-container-orgb85fa6c" class="outline-2">
<h2 id="orgb85fa6c">Chapter four : <b><b>Discord</b></b> users are NOT your friends</h2>
<div class="outline-text-2" id="text-orgb85fa6c">
<p>
<b><b>Discord</b></b> is made in a way that makes it easy to get attached to people, and also really hard to get rid of them, because you share the same servers, same friends, and the border between Private talk and Public talk is really blurred. Not to mention how hard, if not impossible it is to find someone who you met before but lost their contact. Because not only could they change their tag, but there is no way to search their username, and the servers can disappear from a minute to an other, or go private, or anything really !!! Now <a href="http://shystudios.us/blog/discord/discord.html">Shy actually talked about this issue on their article about Discord,</a> but here I&rsquo;m making a different point, in their article they say that it&rsquo;s hard to get rid of someone you know via Discord, which is absolutely true. But it&rsquo;s also easy to lost contact with someone literally in a split second, even people you deem &ldquo;close&rdquo; to you, they just&#x2026;disappear!! So for y&rsquo;all thinking about dating on Discord, that&rsquo;s a terrible idea !!!!
Imagine you&rsquo;re in a <b><b>Discord</b></b> server, vibing with some awesome people, chatting about everything from the latest memes to the mysteries of the universe. You&rsquo;ve become practically inseparable online pals, sharing inside jokes and bonding over your mutual hatred for pineapple on pizza. Life is grand, right?
</p>

<p>
But, brace yourself for the plot twist: <b><b>Discord</b></b> friendships are like a box of chocolates - you never know what you&rsquo;re going to get. People appear and disappear from servers faster than you can say &ldquo;dank meme.&rdquo; One day, your best Discord buddy is there, cracking jokes and sharing dog pics, and the next day, poof, they&rsquo;re gone. Maybe they got bored, maybe real life called, or maybe they wandered into the Discord Bermuda Triangle. Who knows?
</p>

<p>
Now, here&rsquo;s the kicker: finding a lost <b><b>Discord</b></b> friend is like trying to find a grain of sand on a beach during a hurricane. You can&rsquo;t just Google them, and even if you know their username, it&rsquo;s about as useful as a chocolate teapot if they&rsquo;ve changed it. Servers vanish, go private, or morph faster than a Pokémon in a battle. It&rsquo;s like trying to capture smoke with a butterfly net.
</p>

<p>
So, for those pondering the idea of <b><b>Discord</b></b> romance, think twice! While forming connections is a breeze, keeping tabs on those connections is like herding cats in a hurricane!
</p>
</div>
</div>
<div id="outline-container-org77089c6" class="outline-2">
<h2 id="org77089c6">Final Chapter : Login-walls</h2>
<div class="outline-text-2" id="text-org77089c6">
<p>
People have made this point before and i will make it again, but locking important information behind a log-in page, with no way to find them using a Google search is stupid at best and manipulative at worst, because in this situation. Not only are you putting your faith on <b><b>Discord</b></b> servers to not fail one day, but on server Owners to not delete their work (and potentially rare unrecoverable work from other users). Not to mention that you actually need to be in that server to even know of the existence of these kind of resources. Regardless of how you see it, this is just putting valuable info in the hands of random people who could easily lock them behind a specific role that can be obtained either by paying, or by stroking their digital e-penis !!!
</p>

<p>
You see, <b><b>Discord</b></b>, in all its infinite wisdom, believes it&rsquo;s a brilliant idea to squirrel away precious knowledge behind a digital fortress that demands a username and password. It&rsquo;s like saying, &ldquo;Sure, I&rsquo;ll share this life-changing information with you, but only if you can recall your umpteenth password!&rdquo;
</p>

<p>
Now, let&rsquo;s break this down. First, you&rsquo;re entrusting your prized data to <b><b>Discord</b></b> servers, which, let&rsquo;s face it, are about as stable as a Jenga tower during an earthquake. One moment they&rsquo;re there, and the next&#x2026; poof! Gone with the wind. So much for your treasure trove of wisdom.
</p>

<p>
And it gets even better. Server owners have the power to lock away valuable resources behind specific roles, which can be obtained through a combination of charm, flattery, or, heaven forbid, a cash transaction. It&rsquo;s like saying, &ldquo;Want to see the good stuff? Well, pony up or start groveling!&rdquo;
</p>

<p>
So, what&rsquo;s the bottom line here? <b><b>Discord</b></b> has effectively become a modern-age Sphinx, guarding its secrets with a riddle of log-in screens. Your valuable info? In the hands of random folks who could decide to hoard it like misers guarding their gold or sell it to the highest bidder. It&rsquo;s like a digital Wild West, and your information is the wild mustang everyone&rsquo;s trying to wrangle.
</p>

<p>
In conclusion, <b><b>Discord</b></b>&rsquo;s penchant for login-walls is like locking away the Ark of the Covenant in a storage locker and hoping for the best. It&rsquo;s the digital equivalent of hiding your keys in a haystack and hoping you can find them before the cows come home.
</p>
</div>
</div>
<div id="outline-container-orgc273b94" class="outline-2">
<h2 id="orgc273b94">Conclusion</h2>
<div class="outline-text-2" id="text-orgc273b94">
<p>
While <b><b>Discord</b></b> has its quirks and pitfalls, it&rsquo;s essential to remember that it&rsquo;s a reflection of the internet itself - a vast, ever-changing landscape filled with both wonder and peril. Your experience on Discord is uniquely yours, but it&rsquo;s bound to be filled with surprises, friendships, and even the occasional drama.
</p>

<p>
As we wrap up this exploration, it&rsquo;s worth noting that <b><b>Discord</b></b>, like any digital space, is shaped by its users. The tales of adventures and misadventures, the rise and fall of servers, and the endless cycle of drama are all part of the grand tapestry of online life.
</p>

<p>
So, if you find yourself lost in the labyrinthine corridors of <b><b>Discord</b></b> or stumble upon its peculiarities, remember, you&rsquo;re not alone. Many have ventured before you, and many more will follow. The internet, after all, is an ever-evolving, enigmatic landscape where, as in life, every twist and turn holds the promise of a new adventure.
</p>

<p>
If you ever have more anecdotes, insights, or questions to add to this digital saga, feel free to reach out. The story of <b><b>Discord</b></b> is far from over, and your voice could be the missing piece of the puzzle in this fascinating online journey. Until then, peace and love in your digital endeavors, and may your Discord adventures be filled with more joy than chaos!
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Crystal</p>
<p class="date">Created: 2024-03-01 Fri 15:06</p>
</div>
</body>
</html>
